lauterbach-fr/docker_trace32h7/Trace32_H7/TRACE32/demo/source/Arduino15/packages/arduino/hardware/mbed_nicla/4.2.1/boards.txt
menu.split=Flash split
menu.target_core=Target core
menu.security=Security setting
nicla_sense.name=Arduino Nicla Sense ME
nicla_sense.build.core=arduino
nicla_sense.build.crossprefix=arm-none-eabi-
nicla_sense.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
nicla_sense.build.variant=NICLA
nicla_sense.build.mcu=cortex-m4
nicla_sense.build.extra_flags=
nicla_sense.build.architecture=cortex-m4
nicla_sense.build.fpu=-mfpu=fpv4-sp-d16
nicla_sense.build.float-abi=-mfloat-abi=softfp
nicla_sense.build.board=NICLA
nicla_sense.build.ldscript=linker_script.ld
nicla_sense.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52832
nicla_sense.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_sense.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_sense.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_sense.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_sense.compiler.mbed.includes={build.variant.path}/includes.txt
nicla_sense.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_sense.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_sense.vid.0=0x2341
nicla_sense.pid.0=0x0060
nicla_sense.upload_port.0.vid=0x2341
nicla_sense.upload_port.0.pid=0x0060
nicla_sense.upload.tool=openocd
nicla_sense.upload.tool.default=openocd
nicla_sense.upload.protocol=
nicla_sense.upload.config=-f target/nrf52.cfg
nicla_sense.upload.programmer=-f interface/cmsis-dap.cfg
nicla_sense.upload.transport=-c "transport select swd; adapter speed 1000"
nicla_sense.upload.use_1200bps_touch=false
nicla_sense.upload.wait_for_upload_port=true
nicla_sense.upload.native_usb=true
nicla_sense.upload.maximum_size=527616
nicla_sense.upload.maximum_data_size=64288
nicla_sense.programmer.protocol=cmsis-dap
nicla_sense.programmer.transport_script={runtime.platform.path}/debugger/select_swd.cfg
nicla_sense.bootloader.tool=openocd
nicla_sense.bootloader.tool.default=openocd
nicla_sense.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
nicla_sense.bootloader.config=-f target/nrf52.cfg
nicla_sense.bootloader.programmer=-f interface/cmsis-dap.cfg
nicla_sense.bootloader.file=NICLA/bootloader.hex
nicla_sense.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_sense.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_sense.debug.server.openocd.scripts.2=target/nrf52.cfg
nicla_sense.debug.svd_file={runtime.platform.path}/svd/nrf52833.svd
nicla_voice.name=Arduino Nicla Voice
nicla_voice.build.core=arduino
nicla_voice.build.crossprefix=arm-none-eabi-
nicla_voice.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
nicla_voice.build.variant=NICLA
nicla_voice.build.mcu=cortex-m4
nicla_voice.build.extra_flags=
nicla_voice.build.architecture=cortex-m4
nicla_voice.build.fpu=-mfpu=fpv4-sp-d16
nicla_voice.build.float-abi=-mfloat-abi=softfp
nicla_voice.build.board=NICLA
nicla_voice.build.ldscript=linker_script.ld
nicla_voice.build.postbuild.cmd="{tools.imgtool.path}/{tools.imgtool.cmd}" exit
nicla_voice.compiler.mbed.arch.define=-DARDUINO_ARCH_NRF52832
nicla_voice.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_voice.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_voice.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_voice.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_voice.compiler.mbed.includes={build.variant.path}/includes.txt
nicla_voice.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_voice.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_voice.vid.0=0x2341
nicla_voice.pid.0=0x0065
nicla_voice.upload_port.0.vid=0x2341
nicla_voice.upload_port.0.pid=0x0065
nicla_voice.upload.tool=openocd
nicla_voice.upload.tool.default=openocd
nicla_voice.upload.protocol=
nicla_voice.upload.config=-f target/nrf52.cfg
nicla_voice.upload.programmer=-f interface/cmsis-dap.cfg
nicla_voice.upload.transport=-c "transport select swd; adapter speed 1000"
nicla_voice.upload.use_1200bps_touch=false
nicla_voice.upload.wait_for_upload_port=true
nicla_voice.upload.native_usb=true
nicla_voice.upload.maximum_size=527616
nicla_voice.upload.maximum_data_size=64288
nicla_voice.programmer.protocol=cmsis-dap
nicla_voice.programmer.transport_script={runtime.platform.path}/debugger/select_swd.cfg
nicla_voice.bootloader.tool=openocd
nicla_voice.bootloader.tool.default=openocd
nicla_voice.bootloader.extra_action.preflash=echo INFO:removed_mass-erase
nicla_voice.bootloader.config=-f target/nrf52.cfg
nicla_voice.bootloader.programmer=-f interface/cmsis-dap.cfg
nicla_voice.bootloader.file=NICLA_VOICE/bootloader_application.hex
nicla_voice.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_voice.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_voice.debug.server.openocd.scripts.2=target/nrf52.cfg
nicla_voice.debug.svd_file={runtime.platform.path}/svd/nrf52833.svd
nicla_vision.name=Arduino Nicla Vision
nicla_vision.build.core=arduino
nicla_vision.build.crossprefix=arm-none-eabi-
nicla_vision.build.compiler_path={runtime.tools.arm-none-eabi-gcc-7-2017q4.path}/bin/
nicla_vision.menu.target_core.cm7=Main Core
nicla_vision.menu.target_core.cm4=M4 Co-processor
nicla_vision.menu.split.100_0=2MB M7
nicla_vision.menu.split.75_25=1.5MB M7 + 0.5MB M4
nicla_vision.menu.split.50_50=1MB M7 + 1MB M4
nicla_vision.menu.target_core.cm7.build.variant=NICLA_VISION
nicla_vision.menu.target_core.cm7.build.mcu=cortex-m7
nicla_vision.menu.target_core.cm7.build.fpu=-mfpu=fpv5-d16
nicla_vision.menu.target_core.cm7.build.architecture=cortex-m7
nicla_vision.menu.target_core.cm7.compiler.mbed.arch.define=
nicla_vision.menu.target_core.cm4.build.variant=GENERIC_STM32H747_M4
nicla_vision.menu.target_core.cm4.build.mcu=cortex-m4
nicla_vision.menu.target_core.cm4.build.fpu=-mfpu=fpv4-sp-d16
nicla_vision.menu.target_core.cm4.build.architecture=cortex-m4
nicla_vision.menu.target_core.cm4.compiler.mbed.arch.define=-DNVISION_PINS
nicla_vision.menu.split.50_50.build.extra_ldflags=-DCM4_BINARY_START=0x08100000 -DCM4_BINARY_END=0x08200000
nicla_vision.menu.split.75_25.build.extra_ldflags=-DCM4_BINARY_START=0x08180000 -DCM4_BINARY_END=0x08200000
nicla_vision.menu.split.100_0.build.extra_ldflags=-DCM4_BINARY_START=0x60000000 -DCM4_BINARY_END=0x60040000 -DCM4_RAM_END=0x60080000
nicla_vision.build.board={build.variant}
nicla_vision.build.float-abi=-mfloat-abi=softfp
nicla_vision.build.extra_flags=
nicla_vision.build.ldscript=linker_script.ld
nicla_vision.compiler.mbed.defines={build.variant.path}/defines.txt
nicla_vision.compiler.mbed.ldflags={build.variant.path}/ldflags.txt
nicla_vision.compiler.mbed.cflags={build.variant.path}/cflags.txt
nicla_vision.compiler.mbed.cxxflags={build.variant.path}/cxxflags.txt
nicla_vision.compiler.mbed.includes={build.variant.path}/../NICLA_VISION/includes.txt
nicla_vision.compiler.mbed.extra_ldflags=-lstdc++ -lsupc++ -lm -lc -lgcc -lnosys
nicla_vision.compiler.mbed="{build.variant.path}/libs/libmbed.a"
nicla_vision.vid.0=0x2341
nicla_vision.pid.0=0x025f
nicla_vision.vid.1=0x2341
nicla_vision.pid.1=0x035f
nicla_vision.vid.2=0x2341
nicla_vision.pid.2=0x045f
nicla_vision.vid.3=0x2341
nicla_vision.pid.3=0x055f
nicla_vision.upload_port.0.vid=0x2341
nicla_vision.upload_port.0.pid=0x025f
nicla_vision.upload_port.1.vid=0x2341
nicla_vision.upload_port.1.pid=0x035f
nicla_vision.upload_port.2.vid=0x2341
nicla_vision.upload_port.2.pid=0x045f
nicla_vision.upload_port.3.vid=0x2341
nicla_vision.upload_port.3.pid=0x055f
nicla_vision.upload.tool=dfu-util
nicla_vision.upload.tool.default=dfu-util
nicla_vision.upload.protocol=
nicla_vision.upload.transport=
nicla_vision.upload.vid=0x2341
nicla_vision.upload.pid=0x035f
nicla_vision.upload.interface=0
nicla_vision.upload.use_1200bps_touch=true
nicla_vision.upload.wait_for_upload_port=true
nicla_vision.upload.native_usb=true
nicla_vision.upload.maximum_size=1966080
nicla_vision.upload.maximum_data_size=523624
nicla_vision.menu.target_core.cm7.upload.address=0x08040000
nicla_vision.menu.target_core.cm7.menu.split.50_50.upload.maximum_size=786432
nicla_vision.menu.target_core.cm7.menu.split.75_25.upload.maximum_size=1441792
nicla_vision.menu.target_core.cm7.menu.split.100_0.upload.maximum_size=1966080
nicla_vision.menu.target_core.cm7.upload.maximum_data_size=523624
nicla_vision.menu.split.50_50.upload.address_m4=0x08100000
nicla_vision.menu.split.75_25.upload.address_m4=0x08180000
nicla_vision.menu.split.100_0.upload.address_m4=
nicla_vision.menu.target_core.cm4.upload.address={upload.address_m4}
nicla_vision.menu.target_core.cm4.menu.split.50_50.upload.maximum_size=1048576
nicla_vision.menu.target_core.cm4.menu.split.75_25.upload.maximum_size=524288
nicla_vision.menu.target_core.cm4.menu.split.100_0.upload.maximum_size=524288
nicla_vision.menu.target_core.cm4.upload.maximum_data_size=294248
nicla_vision.debug.tool=gdb
nicla_vision.bootloader.tool=openocd
nicla_vision.bootloader.tool.default=openocd
nicla_vision.bootloader.config=-f target/stm32h7x_dual_bank.cfg
nicla_vision.bootloader.programmer=-f interface/stlink.cfg
nicla_vision.bootloader.extra_action.preflash=stm32h7x option_write 0 0x01c 0xb86aaf0
nicla_vision.bootloader.file=NICLA_VISION/bootloader.hex
nicla_vision.debug.server.openocd.scripts.0=interface/{programmer.protocol}.cfg
nicla_vision.debug.server.openocd.scripts.1={programmer.transport_script}
nicla_vision.debug.server.openocd.scripts.2=target/stm32h7x_dual_bank.cfg
nicla_vision.debug.cortex-debug.custom.request=attach
nicla_vision.menu.target_core.cm7.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM7.svd
nicla_vision.menu.target_core.cm4.debug.svd_file={runtime.platform.path}/svd/STM32H747_CM4.svd
